openwch/ch32x315/EVT/EXAM/USBHS/Host/HOST_IAP/APP/User/system_ch32x3x5.c
/********************************** (C) COPYRIGHT *******************************
* File Name          : system_ch32x3x5.c
* Author             : WCH
* Version            : V1.0.1
* Date               : 2026/08/17
* Description        : CH32X3x5 Device Peripheral Access Layer System Source File.
*                      For HSE = 20Mhz
*********************************************************************************
* Copyright (c) 2021 Nanjing Qinheng Microelectronics Co., Ltd.
* Attention: This software (modified or not) and binary are used for 
* microcontroller manufactured by Nanjing Qinheng Microelectronics.
*******************************************************************************/
#include "ch32x3x5.h" 

/* 
* Uncomment the line corresponding to the desired System clock (SYSCLK) frequency (after 
* reset the HSI is used as SYSCLK source).
* If none of the define below is enabled, the HSI is used as System clock source. 
*/

// #define SYSCLK_CoreCLK_HCLK_HSE    HSE_VALUE
// #define SYSCLK_240M_CoreCLK_240M_HCLK_120M_HSE    240000000
#define SYSCLK_240M_CoreCLK_240M_HCLK_240M_HSE    240000000
// #define SYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSE    312500000
// #define SYSCLK_480M_CoreCLK_480M_HCLK_240M_HSE    480000000
// #define SYSCLK_240M_CoreCLK_240M_HCLK_120M_HSI    240000000
// #define SYSCLK_240M_CoreCLK_240M_HCLK_240M_HSI    240000000
// #define SYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSI    312500000
// #define SYSCLK_480M_CoreCLK_480M_HCLK_240M_HSI    480000000

/*Only suitable for commercial applications, with a temperature not exceeding 70 ℃ and good heat dissipation*/
/* // #define SYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSE    625000000
// #define SYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSI    625000000 */

/* Clock Definitions */
#ifdef SYSCLK_CoreCLK_HCLK_HSE
uint32_t SystemClock         = HSE_VALUE;              /* System Clock Frequency */
uint32_t SystemCoreClock     = HSE_VALUE;
uint32_t HCLKClock           = HSE_VALUE;
#elif defined SYSCLK_240M_CoreCLK_240M_HCLK_120M_HSE
uint32_t SystemClock         = SYSCLK_240M_CoreCLK_240M_HCLK_120M_HSE;              /* System Clock Frequency */
uint32_t SystemCoreClock     = SYSCLK_240M_CoreCLK_240M_HCLK_120M_HSE;
uint32_t HCLKClock           = SYSCLK_240M_CoreCLK_240M_HCLK_120M_HSE >> 1;
#elif defined SYSCLK_240M_CoreCLK_240M_HCLK_240M_HSE
uint32_t SystemClock         = SYSCLK_240M_CoreCLK_240M_HCLK_240M_HSE;              /* System Clock Frequency */
uint32_t SystemCoreClock     = SYSCLK_240M_CoreCLK_240M_HCLK_240M_HSE;
uint32_t HCLKClock           = SYSCLK_240M_CoreCLK_240M_HCLK_240M_HSE;
#elif defined SYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSE
uint32_t SystemClock         = SYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSE;        /* System Clock Frequency */
uint32_t SystemCoreClock     = SYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSE;
uint32_t HCLKClock           = SYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSE;
#elif defined SYSCLK_480M_CoreCLK_480M_HCLK_240M_HSE
uint32_t SystemClock         = SYSCLK_480M_CoreCLK_480M_HCLK_240M_HSE;              /* System Clock Frequency */
uint32_t SystemCoreClock     = SYSCLK_480M_CoreCLK_480M_HCLK_240M_HSE;
uint32_t HCLKClock           = SYSCLK_480M_CoreCLK_480M_HCLK_240M_HSE >> 1;
#elif defined SYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSE
uint32_t SystemClock         = SYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSE;            /* System Clock Frequency */
uint32_t SystemCoreClock     = SYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSE;
uint32_t HCLKClock           = SYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSE >> 1;
#elif defined SYSCLK_240M_CoreCLK_240M_HCLK_120M_HSI
uint32_t SystemClock         = SYSCLK_240M_CoreCLK_240M_HCLK_120M_HSI;              /* System Clock Frequency */
uint32_t SystemCoreClock     = SYSCLK_240M_CoreCLK_240M_HCLK_120M_HSI;
uint32_t HCLKClock           = SYSCLK_240M_CoreCLK_240M_HCLK_120M_HSI >> 1;
#elif defined SYSCLK_240M_CoreCLK_240M_HCLK_240M_HSI
uint32_t SystemClock         = SYSCLK_240M_CoreCLK_240M_HCLK_240M_HSI;              /* System Clock Frequency */
uint32_t SystemCoreClock     = SYSCLK_240M_CoreCLK_240M_HCLK_240M_HSI;
uint32_t HCLKClock           = SYSCLK_240M_CoreCLK_240M_HCLK_240M_HSI;
#elif defined SYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSI
uint32_t SystemClock         = SYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSI;        /* System Clock Frequency */
uint32_t SystemCoreClock     = SYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSI;
uint32_t HCLKClock           = SYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSI;
#elif defined SYSCLK_480M_CoreCLK_480M_HCLK_240M_HSI
uint32_t SystemClock         = SYSCLK_480M_CoreCLK_480M_HCLK_240M_HSI;              /* System Clock Frequency */
uint32_t SystemCoreClock     = SYSCLK_480M_CoreCLK_480M_HCLK_240M_HSI;
uint32_t HCLKClock           = SYSCLK_480M_CoreCLK_480M_HCLK_240M_HSI >> 1;
#elif defined SYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSI
uint32_t SystemClock         = SYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSI;            /* System Clock Frequency */
uint32_t SystemCoreClock     = SYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSI;
uint32_t HCLKClock           = SYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSI >> 1;
#else
uint32_t SystemClock         = HSI_VALUE;              /* System Clock Frequency */
uint32_t SystemCoreClock     = HSI_VALUE;
uint32_t HCLKClock           = HSI_VALUE;
#endif

static __I uint8_t PLLDIV[16] = {6, 2, 3, 4, 5, 6, 7, 8, 9, 10, 11, 12, 13, 14, 15, 16};
static __I uint8_t HPrescTable[16] = {0, 0, 0, 0, 0, 0, 0, 0, 1, 2, 3, 4, 6, 7, 8, 9};

/* system_private_function_proto_types */
static void SetSysClock(void);

#ifdef SYSCLK_CoreCLK_HCLK_HSE
static void SetSYSCLK_HCLK_HSE();
#elif defined SYSCLK_240M_CoreCLK_240M_HCLK_120M_HSE
static void SetSYSCLK_240M_CoreCLK_240M_HCLK_120M_HSE( void );
#elif defined SYSCLK_240M_CoreCLK_240M_HCLK_240M_HSE
static void SetSYSCLK_240M_CoreCLK_240M_HCLK_240M_HSE( void );
#elif defined SYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSE
static void SetSYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSE( void );
#elif defined SYSCLK_480M_CoreCLK_480M_HCLK_240M_HSE
static void SetSYSCLK_480M_CoreCLK_480M_HCLK_240M_HSE( void );
#elif defined SYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSE
static void SetSYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSE( void );
#elif defined SYSCLK_240M_CoreCLK_240M_HCLK_120M_HSI
static void SetSYSCLK_240M_CoreCLK_240M_HCLK_120M_HSI( void );
#elif defined SYSCLK_240M_CoreCLK_240M_HCLK_240M_HSI
static void SetSYSCLK_240M_CoreCLK_240M_HCLK_240M_HSI( void );
#elif defined SYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSI
static void SetSYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSI( void );
#elif defined SYSCLK_480M_CoreCLK_480M_HCLK_240M_HSI
static void SetSYSCLK_480M_CoreCLK_480M_HCLK_240M_HSI( void );
#elif defined SYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSI
static void SetSYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSI( void );

#endif


/*********************************************************************
 * @fn      SystemInit
 *
 * @brief   Setup the microcontroller system Initialize the Embedded Flash Interface,
 *        the PLL and update the SystemCoreClock variable.
 *
 * @return  none
 */
void SystemInit (void)
{
  RCC->CTLR |= (uint32_t)0x00000001;    
  while ((RCC->CTLR & (uint32_t)RCC_HSIRDY) != (uint32_t)RCC_HSIRDY)
  {
  }
  RCC->CFGR0 &= (uint32_t)0xFFFFFFFC;
  while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x00)
  {
  }
  RCC->CFGR0 &= (uint32_t)0x00000003;
  RCC->CTLR &= (uint32_t)0x7FFEFFFF;
  RCC->CTLR &= (uint32_t)0xEAF3FEFF;

