openwch/ch32x315/EVT/EXAM/USBHS/Host/HOST_IAP/APP/User/system_ch32x3x5.c
  RCC->INTR = 0x008D0000;
  RCC->CFGR2 &= 0x00C0FC00;
  RCC->CFGR2 |= 0x10000000;

  FLASH->KEYR = ((uint32_t)0x45670123);
  FLASH->KEYR = ((uint32_t)0xCDEF89AB);
  FLASH->MODEKEYR = ((uint32_t)0x45670123);
  FLASH->MODEKEYR = ((uint32_t)0xCDEF89AB);
  FLASH->ACTLR |= ((uint32_t)0x00000800);
  FLASH->CTLR |= ((uint32_t)0x00008080);

  SetSysClock();
}


/*********************************************************************
 * @fn      SystemCoreClockUpdate
 *
 * @brief   Update SystemCoreClock variable according to Clock Register Values.
 *
 * @return  none
 */
void SystemCoreClockUpdate (void)
{
  uint32_t tmp = 0,tmp1 = 0, presc = 0, presc1 = 0;

  tmp = RCC->CFGR0 & RCC_SWS;
  tmp1 = RCC->CFGR0 & RCC_PLLSRC;

  switch(tmp)
  {
      case 0x00:
          SystemClock = HSI_VALUE;
          break;

      case 0x04:
          SystemClock = HSE_VALUE;
          break;

      case 0x08:
          switch(tmp1)
          { 
              case RCC_PLLSRC_USBHSPLL_480M:
                  presc = ((RCC->CFGR0 & RCC_PLLDIV)>>17);
                  SystemClock = 480000000/PLLDIV[presc];
                  break;
              case RCC_PLLSRC_USBSSPLL_625M:
                  presc = ((RCC->CFGR0 & RCC_PLLDIV)>>17);                
                  SystemClock = 625000000/PLLDIV[presc];
                  break;
              case RCC_PLLSRC_HS:
              case RCC_PLLSRC_HS_1:
                  tmp = RCC->CFGR0 & RCC_PLLHS_SRC;
                  switch(tmp)
                  {
                      case RCC_PLLHS_SRC_USBSSPLL_125M:
                          SystemClock = 125000000;
                          break;
                      case RCC_PLLHS_SRC_USBSSPLL_357M:    
                          SystemClock = 357000000;
                          break;
                      case RCC_PLLHS_SRC_USBSSPLL_625M:    
                          SystemClock = 625000000;
                          break; 
                      case RCC_PLLHS_SRC_USBHSPLL_480M:    
                          SystemClock = 480000000;
                          break; 
                      default:
                          SystemClock = HSI_VALUE;
                          break;                                   
                  }
                  break;    

              default:
                  SystemClock = HSI_VALUE;
                  break;
          }  
          break;
      default:
          SystemClock = HSI_VALUE;
          break;
  }
  
  tmp = (RCC->CFGR0 & RCC_HPRE) >> 4;
  presc1 = HPrescTable[tmp];
  SystemCoreClock = SystemClock >> presc1;

  tmp = (RCC->CFGR0 & RCC_FPRE) >> 8;
  HCLKClock = SystemCoreClock >> tmp;
}

/*********************************************************************
 * @fn      SetSysClock
 *
 * @brief   Configures the System clock frequency, HCLK, PCLK2 and PCLK1 prescalers.
 *
 * @return  none
 */
static void SetSysClock(void)
{
    GPIO_IPD_Unused();
#ifdef SYSCLK_CoreCLK_HCLK_HSE
    SetSYSCLK_HCLK_HSE();
#elif defined SYSCLK_240M_CoreCLK_240M_HCLK_120M_HSE
    SetSYSCLK_240M_CoreCLK_240M_HCLK_120M_HSE();
#elif defined SYSCLK_240M_CoreCLK_240M_HCLK_240M_HSE
    SetSYSCLK_240M_CoreCLK_240M_HCLK_240M_HSE();
#elif defined SYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSE
    SetSYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSE();
#elif defined SYSCLK_480M_CoreCLK_480M_HCLK_240M_HSE
    SetSYSCLK_480M_CoreCLK_480M_HCLK_240M_HSE();
#elif defined SYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSE
    SetSYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSE();
#elif defined SYSCLK_240M_CoreCLK_240M_HCLK_120M_HSI
    SetSYSCLK_240M_CoreCLK_240M_HCLK_120M_HSI();
#elif defined SYSCLK_240M_CoreCLK_240M_HCLK_240M_HSI
    SetSYSCLK_240M_CoreCLK_240M_HCLK_240M_HSI();
#elif defined SYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSI
    SetSYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSI();
#elif defined SYSCLK_480M_CoreCLK_480M_HCLK_240M_HSI
    SetSYSCLK_480M_CoreCLK_480M_HCLK_240M_HSI();
#elif defined SYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSI
    SetSYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSI();

#endif
 
 /* If none of the define above is enabled, the HSI is used as System clock
  * source (default after reset) 
    */
}


#ifdef SYSCLK_CoreCLK_HCLK_HSE

/*********************************************************************
 * @fn      SetSYSCLK_HCLK_HSE
 *
 * @brief   Sets HSE as System clock source and configure HCLK, PCLK2 and PCLK1 prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_HCLK_HSE(void)
{
  __IO uint32_t StartUpCounter = 0, HSEStatus = 0, FLASH_Temp = 0;
   
  RCC->CTLR |= ((uint32_t)RCC_HSEON);
 
  /* Wait till HSE is ready and if Time out is reached exit */
  do
  {
    HSEStatus = RCC->CTLR & RCC_HSERDY;
    StartUpCounter++;  
  } while((HSEStatus == 0) && (StartUpCounter != HSE_STARTUP_TIMEOUT));

  if ((RCC->CTLR & RCC_HSERDY) != RESET)
  {
    HSEStatus = (uint32_t)0x01;
  }
  else
  {
    HSEStatus = (uint32_t)0x00;
  }  

  if (HSEStatus == (uint32_t)0x01)
  {
    /* CoreClock = SYSCLK */
    RCC->CFGR0 |= (uint32_t)RCC_HPRE_DIV1;      
    /* HCLK = CoreClock */
    RCC->CFGR0 |= (uint32_t)RCC_FPRE_DIV1;
    
    /* Select FLASH clock frequency*/
    FLASH_Temp = FLASH->ACTLR;
    FLASH_Temp &= ~FLASH_ACTLR_SCK_CFG;
    FLASH_Temp |= FLASH_ACTLR_LATENCY_HCLK_DIV1;
    FLASH->ACTLR = FLASH_Temp;

    /* Select HSE as system clock source */
    RCC->CFGR0 &= (uint32_t)((uint32_t)~(RCC_SW));
    RCC->CFGR0 |= (uint32_t)RCC_SW_HSE;    

    /* Wait till HSE is used as system clock source */
    while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x04)
    {
    }
  }
  else
  { 
        /* If HSE fails to start-up, the application will have wrong clock
     * configuration. User can add here some code to deal with this error 
         */
  }  
}

#elif defined SYSCLK_240M_CoreCLK_240M_HCLK_120M_HSE

/*********************************************************************
 * @fn      SetSYSCLK_240M_CoreCLK_240M_HCLK_120M_HSE
 *
 * @brief   Sets System clock frequency to 120MHz and configure HCLK, PCLK2 and PCLK1 prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_240M_CoreCLK_240M_HCLK_120M_HSE(void)
{
  __IO uint32_t StartUpCounter = 0, HSEStatus = 0, FLASH_Temp = 0;
     
  RCC->CTLR |= ((uint32_t)RCC_HSEON);
  /* Wait till HSE is ready and if Time out is reached exit */
  do
  {
    HSEStatus = RCC->CTLR & RCC_HSERDY;
    StartUpCounter++;  
  } while((HSEStatus == 0) && (StartUpCounter != HSE_STARTUP_TIMEOUT));

