openwch/ch32x315/EVT/EXAM/USBHS/Host/HOST_IAP/APP/User/system_ch32x3x5.c
  if ((RCC->CTLR & RCC_HSERDY) != RESET)
  {
    HSEStatus = (uint32_t)0x01;
  }
  else
  {
    HSEStatus = (uint32_t)0x00;
  }  

  if (HSEStatus == (uint32_t)0x01)
  {
    /* CoreClock = SYSCLK */
    RCC->CFGR0 |= (uint32_t)RCC_HPRE_DIV1;    
    /* HCLK = CoreClock / 2*/
    RCC->CFGR0 |= (uint32_t)RCC_FPRE_DIV2;

    RCC->CFGR2 |= (uint32_t)(RCC_USBHSPLLSRCC_HSE | RCC_USBHSPLLREFSEL_20MHz);

    RCC->CTLR |= RCC_USBHSPLLON;
    /* Wait till USBHSPLL is ready */
    while((RCC->CTLR & RCC_USBHSPLLRDY) == 0)
    {
    }

    RCC->CFGR0 |= (uint32_t)(RCC_PLLSRC_USBHSPLL_480M | RCC_PLLDIV2);

    /* Select FLASH clock frequency*/
    FLASH_Temp = FLASH->ACTLR;
    FLASH_Temp &= ~FLASH_ACTLR_SCK_CFG;
    FLASH_Temp |= FLASH_ACTLR_LATENCY_HCLK_DIV2;
    FLASH->ACTLR = FLASH_Temp;

    /* Select PLL as system clock source */
    RCC->CTLR &= (uint32_t)(~RCC_PLLGATE);
    RCC->CFGR0 |= (uint32_t)RCC_SW_PLL;    
    /* Wait till PLL is used as system clock source */
    while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x08)
    {
    }
  }
  else
  { 
        /*
         * If HSE fails to start-up, the application will have wrong clock
     * configuration. User can add here some code to deal with this error 
         */
  } 
}

#elif defined SYSCLK_240M_CoreCLK_240M_HCLK_240M_HSE

/*********************************************************************
 * @fn      SetSYSCLK_240M_CoreCLK_240M_HCLK_240M_HSE
 *
 * @brief   Sets System clock frequency to 240MHz and configure HCLK, PCLK2 and PCLK1 prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_240M_CoreCLK_240M_HCLK_240M_HSE(void)
{
  __IO uint32_t StartUpCounter = 0, HSEStatus = 0, FLASH_Temp = 0;

  RCC->CTLR |= ((uint32_t)RCC_HSEON);
  /* Wait till HSE is ready and if Time out is reached exit */
  do
  {
    HSEStatus = RCC->CTLR & RCC_HSERDY;
    StartUpCounter++;  
  } while((HSEStatus == 0) && (StartUpCounter != HSE_STARTUP_TIMEOUT));

  if ((RCC->CTLR & RCC_HSERDY) != RESET)
  {
    HSEStatus = (uint32_t)0x01;
  }
  else
  {
    HSEStatus = (uint32_t)0x00;
  }  

  if (HSEStatus == (uint32_t)0x01)
  {
    /* CoreClock = SYSCLK */
    RCC->CFGR0 |= (uint32_t)RCC_HPRE_DIV1;    
    /* HCLK = CoreClock */
    RCC->CFGR0 |= (uint32_t)RCC_FPRE_DIV1;

    RCC->CFGR2 |= (uint32_t)(RCC_USBHSPLLSRCC_HSE | RCC_USBHSPLLREFSEL_20MHz);

    RCC->CTLR |= RCC_USBHSPLLON;
    /* Wait till USBHSPLL is ready */
    while((RCC->CTLR & RCC_USBHSPLLRDY) == 0)
    {
    }

    RCC->CFGR0 |= (uint32_t)(RCC_PLLSRC_USBHSPLL_480M | RCC_PLLDIV2);

    /* Select FLASH clock frequency*/
    FLASH_Temp = FLASH->ACTLR;
    FLASH_Temp &= ~FLASH_ACTLR_SCK_CFG;
    FLASH_Temp |= FLASH_ACTLR_LATENCY_HCLK_DIV4;
    FLASH->ACTLR = FLASH_Temp;

    /* Select PLL as system clock source */
    RCC->CTLR &= (uint32_t)(~RCC_PLLGATE);
    RCC->CFGR0 |= (uint32_t)RCC_SW_PLL;    
    /* Wait till PLL is used as system clock source */
    while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x08)
    {
    }
  }
  else
  { 
        /*
         * If HSE fails to start-up, the application will have wrong clock
     * configuration. User can add here some code to deal with this error 
         */
  } 
}

#elif defined SYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSE

/*********************************************************************
 * @fn      SetSYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSE
 *
 * @brief   Sets System clock frequency to 312_5MHz and configure HCLK, PCLK2 and PCLK1 prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_312_5M_CoreCLK_312_5M_HCLK_312_5M_HSE(void)
{
  __IO uint32_t StartUpCounter = 0, HSEStatus = 0, FLASH_Temp = 0;

  RCC->CTLR |= ((uint32_t)RCC_HSEON);
  /* Wait till HSE is ready and if Time out is reached exit */
  do
  {
    HSEStatus = RCC->CTLR & RCC_HSERDY;
    StartUpCounter++;  
  } while((HSEStatus == 0) && (StartUpCounter != HSE_STARTUP_TIMEOUT));

  if ((RCC->CTLR & RCC_HSERDY) != RESET)
  {
    HSEStatus = (uint32_t)0x01;
  }
  else
  {
    HSEStatus = (uint32_t)0x00;
  }  

  if (HSEStatus == (uint32_t)0x01)
  {
    /* CoreClock = SYSCLK */
    RCC->CFGR0 |= (uint32_t)RCC_HPRE_DIV1;    
    /* HCLK = CoreClock */
    RCC->CFGR0 |= (uint32_t)RCC_FPRE_DIV1;

    RCC->CFGR2 |= (uint32_t)(RCC_USBSSPLLSRCC_HSE | RCC_USBSSPLLREFSEL_20MHz);

    RCC->CTLR |= RCC_USBSSPLLON;
    /* Wait till USBSSPLL is ready */
    while((RCC->CTLR & RCC_USBSSPLLRDY) == 0)
    {
    }

    RCC->CFGR0 |= (uint32_t)(RCC_PLLSRC_USBSSPLL_625M | RCC_PLLDIV2);

    /* Select FLASH clock frequency*/
    FLASH_Temp = FLASH->ACTLR;
    FLASH_Temp &= ~FLASH_ACTLR_SCK_CFG;
    FLASH_Temp |= FLASH_ACTLR_LATENCY_HCLK_DIV8;
    FLASH->ACTLR = FLASH_Temp;

    /* Select PLL as system clock source */
    RCC->CTLR &= (uint32_t)(~RCC_PLLGATE);
    RCC->CFGR0 |= (uint32_t)RCC_SW_PLL;    
    /* Wait till PLL is used as system clock source */
    while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x08)
    {
    }
  }
  else
  { 
        /*
         * If HSE fails to start-up, the application will have wrong clock
     * configuration. User can add here some code to deal with this error 
         */
  } 
}

#elif defined SYSCLK_480M_CoreCLK_480M_HCLK_240M_HSE

/*********************************************************************
 * @fn      SetSYSCLK_480M_CoreCLK_480M_HCLK_240M_HSE
 *
 * @brief   Sets System clock frequency to 480MHz and configure HCLK, PCLK2 and PCLK1 prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_480M_CoreCLK_480M_HCLK_240M_HSE(void)
{
  __IO uint32_t StartUpCounter = 0, HSEStatus = 0, FLASH_Temp = 0;

  RCC->CTLR |= ((uint32_t)RCC_HSEON);
  /* Wait till HSE is ready and if Time out is reached exit */
  do
  {
    HSEStatus = RCC->CTLR & RCC_HSERDY;
    StartUpCounter++;  
  } while((HSEStatus == 0) && (StartUpCounter != HSE_STARTUP_TIMEOUT));

  if ((RCC->CTLR & RCC_HSERDY) != RESET)
  {
    HSEStatus = (uint32_t)0x01;
  }
  else
  {
    HSEStatus = (uint32_t)0x00;
  }  

  if (HSEStatus == (uint32_t)0x01)
  {
    /* CoreClock = SYSCLK */
    RCC->CFGR0 |= (uint32_t)RCC_HPRE_DIV1;    
    /* HCLK = CoreClock / 2 */
    RCC->CFGR0 |= (uint32_t)RCC_FPRE_DIV2;

    RCC->CFGR2 |= (uint32_t)(RCC_USBHSPLLSRCC_HSE | RCC_USBHSPLLREFSEL_20MHz);

