openwch/ch32x315/EVT/EXAM/USBHS/Host/HOST_IAP/APP/User/system_ch32x3x5.c
  RCC->CFGR0 |= (uint32_t)(RCC_PLLSRC_USBSSPLL_625M | RCC_PLLDIV2);

  /* Select FLASH clock frequency*/
  FLASH_Temp = FLASH->ACTLR;
  FLASH_Temp &= ~FLASH_ACTLR_SCK_CFG;
  FLASH_Temp |= FLASH_ACTLR_LATENCY_HCLK_DIV8;
  FLASH->ACTLR = FLASH_Temp;

  /* Select PLL as system clock source */
  RCC->CTLR &= (uint32_t)(~RCC_PLLGATE);
  RCC->CFGR0 |= (uint32_t)RCC_SW_PLL;    
  /* Wait till PLL is used as system clock source */
  while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x08)
  {
  }
}

#elif defined SYSCLK_480M_CoreCLK_480M_HCLK_240M_HSI

/*********************************************************************
 * @fn      SetSYSCLK_480M_CoreCLK_480M_HCLK_240M_HSI
 *
 * @brief   Sets System clock frequency to 480MHz and configure HCLK, PCLK2 and PCLK1 prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_480M_CoreCLK_480M_HCLK_240M_HSI(void)
{
  __IO uint32_t FLASH_Temp = 0;

  /* CoreClock = SYSCLK */
  RCC->CFGR0 |= (uint32_t)RCC_HPRE_DIV1;    
  /* HCLK = CoreClock / 2 */
  RCC->CFGR0 |= (uint32_t)RCC_FPRE_DIV2;

  RCC->CFGR2 |= (uint32_t)(RCC_USBHSPLLSRCC_HSI | RCC_USBHSPLLREFSEL_20MHz);

  RCC->CTLR |= RCC_USBHSPLLON;
  /* Wait till USBHSPLL is ready */
  while((RCC->CTLR & RCC_USBHSPLLRDY) == 0)
  {
  }

  RCC->CFGR0 |= (uint32_t)(RCC_PLLSRC_HS|RCC_PLLHS_SRC_USBHSPLL_480M);

  /* Select FLASH clock frequency*/
  FLASH_Temp = FLASH->ACTLR;
  FLASH_Temp &= ~FLASH_ACTLR_SCK_CFG;
  FLASH_Temp |= FLASH_ACTLR_LATENCY_HCLK_DIV4;
  FLASH->ACTLR = FLASH_Temp;

  /* Select PLL as system clock source */
  RCC->CTLR &= (uint32_t)(~RCC_PLLGATE);
  RCC->CFGR0 |= (uint32_t)RCC_SW_PLL;    
  /* Wait till PLL is used as system clock source */
  while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x08)
  {
  }
}

#elif defined SYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSI
/*********************************************************************
 * @fn      SetSYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSI
 *
 * @brief   Sets System clock frequency to 625MHz and configure HCLK, PCLK2 and PCLK1 prescalers.
 *
 * @return  none
 */
static void SetSYSCLK_625M_CoreCLK_625M_HCLK_312_5M_HSI(void)
{
  __IO uint32_t FLASH_Temp = 0;
  /* Select LDO_VDDK to 111b */
  vu32 tmp = 0;
  tmp = PWR->CTLR;
  tmp &= ~(0x7 << 8);
  tmp |= (0x7 << 8);
  PWR->CTLR = tmp;

  /* CoreClock = SYSCLK */
  RCC->CFGR0 |= (uint32_t)RCC_HPRE_DIV1;    
  /* HCLK = CoreClock / 2 */
  RCC->CFGR0 |= (uint32_t)RCC_FPRE_DIV2;

  RCC->CFGR2 |= (uint32_t)(RCC_USBSSPLLSRCC_HSI | RCC_USBSSPLLREFSEL_20MHz);

  RCC->CTLR |= RCC_USBSSPLLON;
  /* Wait till USBHSPLL is ready */
  while((RCC->CTLR & RCC_USBSSPLLRDY) == 0)
  {
  }

  RCC->CFGR0 |= (uint32_t)(RCC_PLLSRC_HS|RCC_PLLHS_SRC_USBSSPLL_625M);

  /* Select FLASH clock frequency*/
  FLASH_Temp = FLASH->ACTLR;
  FLASH_Temp &= ~FLASH_ACTLR_SCK_CFG;
  FLASH_Temp |= FLASH_ACTLR_LATENCY_HCLK_DIV8;
  FLASH->ACTLR = FLASH_Temp;

  /* Select PLL as system clock source */
  RCC->CTLR &= (uint32_t)(~RCC_PLLGATE);
  RCC->CFGR0 |= (uint32_t)RCC_SW_PLL;    
  /* Wait till PLL is used as system clock source */
  while ((RCC->CFGR0 & (uint32_t)RCC_SWS) != (uint32_t)0x08)
  {
  }
}

#endif
